# Pre-processing Data in Python #

In [1]:
# It is the process of converting or mapping data from the initial 'raw' form into another format, in order to prepare the data for further analysis.
# It is often called data cleaning or data wrangling
# In python, we perform operations along columns. Each row of the column represents a sample. A column is accessed by specifying the name of the column. Each of the columns is a pandas series.
# The are many ways to manipulate dataframes in python E.g add a value to each entry of the column.

## Dealing with missing values in Python ##

In [2]:
# This occurs when no data value is stored for a variable in an observation. It could be reresented as "?", "N/A", 0 or blank cell
# How to deal with missing values

In [3]:
import numpy as np
import pandas as pd

## Dealing with missing values ##

## Handling Missing Data with Pandas ##

In [4]:
import numpy as np
import pandas as pd

In [5]:
pd.isnull(np.nan) # where nan means Not A Number

True

In [6]:
pd.isnull(None)

True

In [7]:
pd.isna(np.nan)

True

In [8]:
pd.isna(None)

True

The opposite ones also exist

In [9]:
pd.notnull(np.nan)

False

In [10]:
pd.notnull(None)

False

In [11]:
pd.notnull(3)

True

Thisfunction also works witth Series and Dataframes

In [12]:
pd.isnull(pd.Series([1, np.nan, 7]))

0    False
1     True
2    False
dtype: bool

In [13]:
pd.notnull(pd.Series([1, np.nan, 7]))

0     True
1    False
2     True
dtype: bool

In [14]:
pd.isnull(pd.DataFrame({
    'Column A': [1, np.nan, 7],
    'Column B': [np.nan, 2, 3],
    'Column C': [np.nan, 2, np.nan]}))

   Column A  Column B  Column C
0     False      True      True
1      True     False     False
2     False     False      True

## Pandas Operations with Missing Values ##

Pandas manages missing values more gracefully than numpy

In [15]:
pd.Series([1, 2, np.nan]).count()

2

In [16]:
pd.Series([1, 2, np.nan]).sum()

3.0

In [17]:
pd.Series([1, 2, np.nan]).mean()

1.5

### Filtering missing values ###

In [18]:
s = pd.Series([1, 2, 3, np.nan, np.nan, 4])

In [19]:
pd.notnull(s)

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [20]:
pd.isnull(s)

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [21]:
pd.notnull(s).count()

6

In [22]:
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [23]:
s[pd.isnull(s)]

3   NaN
4   NaN
dtype: float64

In [24]:
pd.notnull(s).sum() # to get the summary of notnull values

4

In [25]:
pd.isnull(s).sum() # to get the summary of null values

2

Both notnull ans isnull are also methods of Series and DataFrame s, so we could use it that way

In [26]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [27]:
s.notnull()

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [28]:
s[s.notnull()]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

### Dropping null values ###

In [29]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [30]:
s.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

### Dropping null values on DataFrames ###

In [31]:
df = pd.DataFrame({
    'Column A': [1, np.nan, 30, np.nan],
    'Column B': [2, 8, 31, np.nan],
    'Column C': [np.nan, 9, 32, 100],
    'Column D': [5, 8, 34, 110],
})

In [32]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [33]:
df.shape

(4, 4)

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column A  2 non-null      float64
 1   Column B  3 non-null      float64
 2   Column C  3 non-null      float64
 3   Column D  4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 256.0 bytes

In [35]:
df.isnull()

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

In [36]:
df.isnull().sum() # a quick reference of how many null values in the DF

Column A    2
Column B    1
Column C    1
Column D    0
dtype: int64

The default dropna behavior will drop all the rows in which any null value is present

In [37]:
df.dropna() # drops any row that has at least one null value

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

In this case we're dropping rows. Rows containing null values are dropped from the DF. You can also use the axis parameter to drop columns containing null values

In [38]:
df.dropna(axis = 1) # axis = columns also works. This keeps the column that has no null value.

   Column D
0         5
1         8
2        34
3       110

Below, any row or column that contains at least one nul value will be dropped. You can control the behavior with the 'how' parameter which can be either 'any'or 'all'

In [39]:
df2 = pd.DataFrame({
    'Column A': [1, np.nan, 30],
    'Column B': [2, np.nan, 31],
    'Column C': [np.nan, np.nan, 100],
})

In [40]:
df2

   Column A  Column B  Column C
0       1.0       2.0       NaN
1       NaN       NaN       NaN
2      30.0      31.0     100.0

In [41]:
df.dropna(how = 'all') # drops all the rows with all the values null

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [42]:
df.dropna(how = 'any') # drops all the rows that has any of the values null

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

We use the thresh parameterto indicate a threshold (a minimum number) of non-null values for the row/column to be kept

In [43]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [44]:
df.dropna(thresh = 3) # keeps the amount of valid values. In this case, keeps rows with 3 valid values

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34

In [45]:
df.dropna(thresh = 3, axis = 'columns') # In this case, keeps columns with 3 valid values

   Column B  Column C  Column D
0       2.0       NaN         5
1       8.0       9.0         8
2      31.0      32.0        34
3       NaN     100.0       110

# Filling null values #

In [46]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

Filling nulls with a arbitrary value. This means to fill the NAs with a particular value or any statistical value.

In [47]:
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    4.0
dtype: float64

In [48]:
s.fillna(s.mean()) # you can use any statistical method you want

0    1.0
1    2.0
2    3.0
3    2.5
4    2.5
5    4.0
dtype: float64

In [49]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

**Filling nulls with contiguous (close) values**

The method argument is used to fill null values with other values close to that null one

In [50]:
s.fillna(method = 'ffill') # forward fill method is used to fill null values close to it top down

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [51]:
s.fillna(method = 'bfill') # backward fill method is used to fill null values close to it bottom up

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

This can still leave null values at the other extreme of the Series\DataFrame

In [52]:
pd.Series([np.nan, 3, np.nan, 9]).fillna(method = 'ffill')

0    NaN
1    3.0
2    3.0
3    9.0
dtype: float64

In [53]:
pd.Series([1, np.nan, 3, np.nan, np.nan]).fillna(method = 'bfill')

0    1.0
1    3.0
2    3.0
3    NaN
4    NaN
dtype: float64

**Filling null values on DataFrames**

The fillna method also works similarly on DataFrames. The only difference is that you can specify the axis (rows & columns to use to fill the values.

In [54]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [55]:
df.fillna({'Column A': 0, 'Column B': 99, 'Column C': df['Column C'].mean()})

   Column A  Column B  Column C  Column D
0       1.0       2.0      47.0         5
1       0.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       0.0      99.0     100.0       110

In [56]:
df.fillna(method = 'ffill', axis = 0) # this fills the columns top down

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       1.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3      30.0      31.0     100.0       110

In [57]:
df.fillna(method = 'ffill', axis = 1) # this fills the rows from left to right (horizontally)

   Column A  Column B  Column C  Column D
0       1.0       2.0       2.0       5.0
1       NaN       8.0       9.0       8.0
2      30.0      31.0      32.0      34.0
3       NaN       NaN     100.0     110.0

### Hands on! ###

In [58]:
df = pd.DataFrame({
    'Sex': ['M', 'F','F', 'D', '?'],
    'Age': [29, 30, 24, 290, 25],
})
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

Finding Unique Values

In [59]:
df['Sex'].unique()

array(['M', 'F', 'D', '?'], dtype=object)

In [60]:
df['Sex'].value_counts()

F    2
M    1
D    1
?    1
Name: Sex, dtype: int64

In [61]:
df['Sex'].replace('D', 'F')

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [62]:
df['Sex'].replace({'D':'F', 'N':'N'})

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [63]:
df.replace({
    'Sex': {
        'D':'F',
        'N': 'M'
    },
    'Age': {
        290: 29
    }
})

  Sex  Age
0   M   29
1   F   30
2   F   24
3   F   29
4   ?   25

In [64]:
df[df['Age'] > 100]

  Sex  Age
3   D  290

In [65]:
df.loc[df['Age'] > 100, 'Age'] = df.loc[df['Age'] > 100, 'Age'] / 10

In [66]:
df

  Sex   Age
0   M  29.0
1   F  30.0
2   F  24.0
3   D  29.0
4   ?  25.0

**Checking if there are NAs**

Example 1: 
Checking the length # if there are missing values, s.dropna() will have less elements than s

In [67]:
s.dropna().count() # to check how many null values exists

4

In [68]:
missing_values = len(s.dropna()) != len(s)
missing_values

True

In [69]:
len(s)

6

In [70]:
s.count()

4

In [71]:
missing_values = s.count() != len(s)
missing_values

True

**More Pythonic solution any**

The method any and all check if either there's any True value in a series or all the values are True

In [72]:
pd.Series([True, False, False]).any()

True

In [73]:
pd.Series([True, False, False]).all()

False

In [74]:
pd.Series([True, True, True]).all()

True

The isnull() method returned a Boolean Series

In [75]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

So we can just use the any method with the boolean array returned

In [76]:
pd.Series([1, np.nan]).isnull().any()

True

In [77]:
pd.Series([1, 2]).isnull().any()

False

In [78]:
s.isnull().any()

True

A more strict version checks only the values of the series

In [79]:
s.isnull().values

array([False, False, False,  True,  True, False])

In [80]:
s.isnull().values.any()

True

## Duplicates ##

Dealing with duplicates in data series. Example is when ambassadors are invited to a party and we do not want more than one ambassador per country.

In [81]:
ambassadors = pd.Series([
    'France',
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
],  index = [
    'Gerard Araud',
    'Kim Dorroch',
    'Peter Westmacott',
    'Armando Verricchio', 
    'Peter Wittig',
    'Peter Amon',
    'Klaus Scharioth',
])

In [82]:
ambassadors

Gerard Araud                  France
Kim Dorroch           United Kingdom
Peter Westmacott      United Kingdom
Armando Verricchio             Italy
Peter Wittig                 Germany
Peter Amon                   Germany
Klaus Scharioth              Germany
dtype: object

The 2 most important methods to deal with duplicates are 'duplicated' (tells you which values are duplicated) and 'drop_duplicates (gets rid of the duplicates):

In [83]:
ambassadors.duplicated() # keeps default i.e top down

Gerard Araud          False
Kim Dorroch           False
Peter Westmacott       True
Armando Verricchio    False
Peter Wittig          False
Peter Amon             True
Klaus Scharioth        True
dtype: bool

In [84]:
ambassadors.duplicated(keep = 'last') # keeps last i.e bottom up

Gerard Araud          False
Kim Dorroch            True
Peter Westmacott      False
Armando Verricchio    False
Peter Wittig           True
Peter Amon             True
Klaus Scharioth       False
dtype: bool

In [85]:
ambassadors.duplicated(keep = False)

Gerard Araud          False
Kim Dorroch            True
Peter Westmacott       True
Armando Verricchio    False
Peter Wittig           True
Peter Amon             True
Klaus Scharioth        True
dtype: bool

In [86]:
ambassadors.drop_duplicates()

Gerard Araud                  France
Kim Dorroch           United Kingdom
Armando Verricchio             Italy
Peter Wittig                 Germany
dtype: object

In [87]:
ambassadors.drop_duplicates(keep = 'last')

Gerard Araud                  France
Peter Westmacott      United Kingdom
Armando Verricchio             Italy
Klaus Scharioth              Germany
dtype: object

In [88]:
ambassadors.drop_duplicates(keep = False)

Gerard Araud          France
Armando Verricchio     Italy
dtype: object

**Duplicates in DataFrames**

In [89]:
players = pd.DataFrame({
    'Name': [
        'Kobe Bryant',
        'Lebron James',
        'Kobe Bryant',
        'Camelo Anthony',
        'Kobe Bryant',
    ],
    'Pos': [
        'SG',
        'SF',
        'SG',
        'SF',
        'SF'
    ]
})

In [90]:
players

             Name Pos
0     Kobe Bryant  SG
1    Lebron James  SF
2     Kobe Bryant  SG
3  Camelo Anthony  SF
4     Kobe Bryant  SF

In [91]:
players.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [92]:
players.duplicated(subset = ['Name'])

0    False
1    False
2     True
3    False
4     True
dtype: bool

**Text Handling**

**Splitting Columns**

In [93]:
df = pd.DataFrame({
    'Data': [
        '1987_M_US_1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1970?_M_ IT_1',
        '1985_F_I T_2'
]})

In [94]:
df

            Data
0    1987_M_US_1
1   1990?_M_UK_1
2    1992_F_US_2
3  1970?_M_ IT_1
4   1985_F_I T_2

In [95]:
df['Data'].str.split('_')

0      [1987, M, US, 1]
1     [1990?, M, UK, 1]
2      [1992, F, US, 2]
3    [1970?, M,  IT, 1]
4     [1985, F, I T, 2]
Name: Data, dtype: object

In [96]:
df['Data'].str.split('_', expand = True)

       0  1    2  3
0   1987  M   US  1
1  1990?  M   UK  1
2   1992  F   US  2
3  1970?  M   IT  1
4   1985  F  I T  2

In [97]:
df = df['Data'].str.split('_', expand = True)

In [98]:
df.columns = ['Year', 'Sex', 'Country', 'No Children']

In [99]:
df

    Year Sex Country No Children
0   1987   M      US           1
1  1990?   M      UK           1
2   1992   F      US           2
3  1970?   M      IT           1
4   1985   F     I T           2

In [100]:
df['Year'].str.contains('\?')

0    False
1     True
2    False
3     True
4    False
Name: Year, dtype: bool

In [101]:
df['Country'].str.contains('U')

0     True
1     True
2     True
3    False
4    False
Name: Country, dtype: bool

In [102]:
df['Country'].str.strip()

0     US
1     UK
2     US
3     IT
4    I T
Name: Country, dtype: object

In [103]:
df['Country'].str.replace(' ', '')

0    US
1    UK
2    US
3    IT
4    IT
Name: Country, dtype: object

In [104]:
df['Year'].str.replace(r'(?P<year>\d{4})?', lambda n: n.group('year'))

C:\Users\user\AppData\Local\Temp/ipykernel_13584/3529615062.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df['Year'].str.replace(r'(?P<year>\d{4})?', lambda n: n.group('year'))

0     1987
1    1990?
2     1992
3    1970?
4     1985
Name: Year, dtype: object

In [105]:
import numpy as np
import pandas as pd

## Loading or Reading the File ##

Encoding error
Inconsistent rows

In [106]:
df = pd.read_csv('C:\\Users\\user\\Desktop\\Jupyter notebooks for Data Science\\Unclean+data+set+for+Data+Cleaning+Lesson.csv')

In [107]:
df.head()

,movie_title,num_critic_for_reviews,duration,DIRECTOR_facebook_likes,actor_3_facebook_likes,ACTOR_1_facebook_likes,gross,num_voted_users,Cast_Total_facebook_likes,facenumber_in_poster,num_user_for_reviews,budget,title_year,ACTOR_2_facebook_likes,imdb_score,title_year.1
0,Avatar?�,723,178.0,10,855,1000,760505847,886204.0,4834.0,NaN,3054,237000000,2009,936.0,7.9,2009.0
1,Pirates of the Caribbean: At World's End?�,302,NaN,563,1000,40000,309404152,471220.0,48350.0,NaN,1238,300000000,2007,5000.0,7.1,NaN
2,Spectre?�,602,148.0,20,161,11000,200074175,275868.0,11700.0,1.0,994,245000000,2015,393.0,6.8,2015.0
3,The Dark Knight Rises?�,813,NaN,22000,23000,27000,448130642,1144337.0,106759.0,NaN,2701,250000000,2012,23000.0,8.5,NaN
4,John Carter?�,462,132.0,"""475""",530,640,73058679,212204.0,1873.0,1.0,738,263700000,2012,632.0,6.6,NaN

In [108]:
df = pd.read_csv('C:\\Users\\user\\Desktop\\Jupyter notebooks for Data Science\\Unclean+data+set+for+Data+Cleaning+Lesson.csv', encoding = 'latin1')

In [109]:
df.head()

,movie_title,num_critic_for_reviews,duration,DIRECTOR_facebook_likes,actor_3_facebook_likes,ACTOR_1_facebook_likes,gross,num_voted_users,Cast_Total_facebook_likes,facenumber_in_poster,num_user_for_reviews,budget,title_year,ACTOR_2_facebook_likes,imdb_score,title_year.1
0,Avatar?ï¿½,723,178.0,10,855,1000,760505847,886204.0,4834.0,NaN,3054,237000000,2009,936.0,7.9,2009.0
1,Pirates of the Caribbean: At World's End?ï¿½,302,NaN,563,1000,40000,309404152,471220.0,48350.0,NaN,1238,300000000,2007,5000.0,7.1,NaN
2,Spectre?ï¿½,602,148.0,20,161,11000,200074175,275868.0,11700.0,1.0,994,245000000,2015,393.0,6.8,2015.0
3,The Dark Knight Rises?ï¿½,813,NaN,22000,23000,27000,448130642,1144337.0,106759.0,NaN,2701,250000000,2012,23000.0,8.5,NaN
4,John Carter?ï¿½,462,132.0,"""475""",530,640,73058679,212204.0,1873.0,1.0,738,263700000,2012,632.0,6.6,NaN

Inconsistent Column Names
. Change cases
. Rename them

In [110]:
df.columns

Index(['movie_title', 'num_critic_for_reviews', 'duration',
       'DIRECTOR_facebook_likes', 'actor_3_facebook_likes',
       'ACTOR_1_facebook_likes', 'gross', 'num_voted_users',
       'Cast_Total_facebook_likes', 'facenumber_in_poster',
       'num_user_for_reviews', 'budget', 'title_year',
       'ACTOR_2_facebook_likes', 'imdb_score', 'title_year.1'],
      dtype='object')

Change the case to Upper

In [111]:
df.columns.str.upper()

Index(['MOVIE_TITLE', 'NUM_CRITIC_FOR_REVIEWS', 'DURATION',
       'DIRECTOR_FACEBOOK_LIKES', 'ACTOR_3_FACEBOOK_LIKES',
       'ACTOR_1_FACEBOOK_LIKES', 'GROSS', 'NUM_VOTED_USERS',
       'CAST_TOTAL_FACEBOOK_LIKES', 'FACENUMBER_IN_POSTER',
       'NUM_USER_FOR_REVIEWS', 'BUDGET', 'TITLE_YEAR',
       'ACTOR_2_FACEBOOK_LIKES', 'IMDB_SCORE', 'TITLE_YEAR.1'],
      dtype='object')

In [112]:
df.columns = df.columns.str.upper()

In [113]:
df.columns

Index(['MOVIE_TITLE', 'NUM_CRITIC_FOR_REVIEWS', 'DURATION',
       'DIRECTOR_FACEBOOK_LIKES', 'ACTOR_3_FACEBOOK_LIKES',
       'ACTOR_1_FACEBOOK_LIKES', 'GROSS', 'NUM_VOTED_USERS',
       'CAST_TOTAL_FACEBOOK_LIKES', 'FACENUMBER_IN_POSTER',
       'NUM_USER_FOR_REVIEWS', 'BUDGET', 'TITLE_YEAR',
       'ACTOR_2_FACEBOOK_LIKES', 'IMDB_SCORE', 'TITLE_YEAR.1'],
      dtype='object')

Renaming Columns

In [114]:
df.rename(columns = {'DURATION':'TIME'})

,MOVIE_TITLE,NUM_CRITIC_FOR_REVIEWS,TIME,DIRECTOR_FACEBOOK_LIKES,ACTOR_3_FACEBOOK_LIKES,ACTOR_1_FACEBOOK_LIKES,GROSS,NUM_VOTED_USERS,CAST_TOTAL_FACEBOOK_LIKES,FACENUMBER_IN_POSTER,NUM_USER_FOR_REVIEWS,BUDGET,TITLE_YEAR,ACTOR_2_FACEBOOK_LIKES,IMDB_SCORE,TITLE_YEAR.1
0,Avatar?ï¿½,723,178.0,10,855,1000,760505847,886204.0,4834.0,NaN,3054,237000000,2009,936.0,7.9,2009.0
1,Pirates of the Caribbean: At World's End?ï¿½,302,NaN,563,1000,40000,309404152,471220.0,48350.0,NaN,1238,300000000,2007,5000.0,7.1,NaN
2,Spectre?ï¿½,602,148.0,20,161,11000,200074175,275868.0,11700.0,1.0,994,245000000,2015,393.0,6.8,2015.0
3,The Dark Knight Rises?ï¿½,813,NaN,22000,23000,27000,448130642,1144337.0,106759.0,NaN,2701,250000000,2012,23000.0,8.5,NaN
4,John Carter?ï¿½,462,132.0,"""475""",530,640,73058679,212204.0,1873.0,1.0,738,263700000,2012,632.0,6.6,NaN
5,Spider-Man 3?ï¿½,392,156.0,23,4000,24000,336530303,383056.0,46055.0,NaN,1902,258000000,2007,11000.0,6.2,2007.0
6,Tangled?ï¿½,324,NaN,15,284,799,200807262,294810.0,NaN,1.0,387,260000000,2010,553.0,7.8,NaN
7,Avengers: Age of Ultron?ï¿½,635,141.0,10,19000,26000,458991599,462669.0,92000.0,4.0,1117,250000000,2015,21000.0,7.5,NaN
8,Avengers: Age of Ultron?ï¿½,635,141.0,10,19000,26000,458991599,462669.0,92000.0,4.0,1117,250000000,2015,21000.0,7.5,2015.0
9,Harry Potter and the Half-Blood Prince?ï¿½,375,153.0,282,10000,25000,301956980,321795.0,58753.0,3.0,973,250000000,2009,11000.0,7.5,NaN
10,Batman v Superman: Dawn of Justice?ï¿½,673,183.0,NaN,2000,15000,330249062,NaN,24450.0,NaN,3018,250000000,2016,NaN,6.9,2016.0
11,Superman Returns?ï¿½,434,169.0,NaN,903,18000,200069408,240396.0,NaN,2.0,2367,209000000,2006,10000.0,6.1,NaN
12,Quantum of Solace?ï¿½,403,106.0,395,393,451,168368427,330784.0,2023.0,1.0,1243,200000000,2008,412.0,6.7,2008.0
13,Pirates of the Caribbean: Dead Man's Chest?ï¿½,313,151.0,563,1000,40000,423032628,522040.0,48486.0,2.0,1832,225000000,2006,5000.0,7.3,2008.0

Missing data

In [115]:
df.isnull()

,MOVIE_TITLE,NUM_CRITIC_FOR_REVIEWS,DURATION,DIRECTOR_FACEBOOK_LIKES,ACTOR_3_FACEBOOK_LIKES,ACTOR_1_FACEBOOK_LIKES,GROSS,NUM_VOTED_USERS,CAST_TOTAL_FACEBOOK_LIKES,FACENUMBER_IN_POSTER,NUM_USER_FOR_REVIEWS,BUDGET,TITLE_YEAR,ACTOR_2_FACEBOOK_LIKES,IMDB_SCORE,TITLE_YEAR.1
0,False,False,False,False,False,False,False,False,False,True,False,False,False,False,False,False
1,False,False,True,False,False,False,False,False,False,True,False,False,False,False,False,True
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,True,False,False,False,False,False,False,True,False,False,False,False,False,True
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,True
5,False,False,False,False,False,False,False,False,False,True,False,False,False,False,False,False
6,False,False,True,False,False,False,False,False,True,False,False,False,False,False,False,True
7,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,True
8,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
9,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,True
10,False,False,False,True,False,False,False,True,False,True,False,False,False,True,False,False
11,False,False,False,True,False,False,False,False,True,False,False,False,False,False,False,True
12,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
13,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [116]:
df.isnull().any()

MOVIE_TITLE                  False
NUM_CRITIC_FOR_REVIEWS       False
DURATION                      True
DIRECTOR_FACEBOOK_LIKES       True
ACTOR_3_FACEBOOK_LIKES       False
ACTOR_1_FACEBOOK_LIKES       False
GROSS                        False
NUM_VOTED_USERS               True
CAST_TOTAL_FACEBOOK_LIKES     True
FACENUMBER_IN_POSTER          True
NUM_USER_FOR_REVIEWS         False
BUDGET                       False
TITLE_YEAR                   False
ACTOR_2_FACEBOOK_LIKES        True
IMDB_SCORE                   False
TITLE_YEAR.1                  True
dtype: bool

In [117]:
df.isnull().any().any() # for missing value in the entire Dataframe

True

In [118]:
df.isnull().sum() # for columns with any missing value

MOVIE_TITLE                  0
NUM_CRITIC_FOR_REVIEWS       0
DURATION                     3
DIRECTOR_FACEBOOK_LIKES      2
ACTOR_3_FACEBOOK_LIKES       0
ACTOR_1_FACEBOOK_LIKES       0
GROSS                        0
NUM_VOTED_USERS              1
CAST_TOTAL_FACEBOOK_LIKES    2
FACENUMBER_IN_POSTER         5
NUM_USER_FOR_REVIEWS         0
BUDGET                       0
TITLE_YEAR                   0
ACTOR_2_FACEBOOK_LIKES       1
IMDB_SCORE                   0
TITLE_YEAR.1                 7
dtype: int64

In [119]:
df.isnull().sum().sum() # for total number of missing values

21

Adding a Default Value or Filling the Missing Data

In [120]:
df.head()

,MOVIE_TITLE,NUM_CRITIC_FOR_REVIEWS,DURATION,DIRECTOR_FACEBOOK_LIKES,ACTOR_3_FACEBOOK_LIKES,ACTOR_1_FACEBOOK_LIKES,GROSS,NUM_VOTED_USERS,CAST_TOTAL_FACEBOOK_LIKES,FACENUMBER_IN_POSTER,NUM_USER_FOR_REVIEWS,BUDGET,TITLE_YEAR,ACTOR_2_FACEBOOK_LIKES,IMDB_SCORE,TITLE_YEAR.1
0,Avatar?ï¿½,723,178.0,10,855,1000,760505847,886204.0,4834.0,NaN,3054,237000000,2009,936.0,7.9,2009.0
1,Pirates of the Caribbean: At World's End?ï¿½,302,NaN,563,1000,40000,309404152,471220.0,48350.0,NaN,1238,300000000,2007,5000.0,7.1,NaN
2,Spectre?ï¿½,602,148.0,20,161,11000,200074175,275868.0,11700.0,1.0,994,245000000,2015,393.0,6.8,2015.0
3,The Dark Knight Rises?ï¿½,813,NaN,22000,23000,27000,448130642,1144337.0,106759.0,NaN,2701,250000000,2012,23000.0,8.5,NaN
4,John Carter?ï¿½,462,132.0,"""475""",530,640,73058679,212204.0,1873.0,1.0,738,263700000,2012,632.0,6.6,NaN

In [121]:
df_with_0 = df.fillna(0) # Fills missing data with zeros

In [122]:
df_with_0.head()

,MOVIE_TITLE,NUM_CRITIC_FOR_REVIEWS,DURATION,DIRECTOR_FACEBOOK_LIKES,ACTOR_3_FACEBOOK_LIKES,ACTOR_1_FACEBOOK_LIKES,GROSS,NUM_VOTED_USERS,CAST_TOTAL_FACEBOOK_LIKES,FACENUMBER_IN_POSTER,NUM_USER_FOR_REVIEWS,BUDGET,TITLE_YEAR,ACTOR_2_FACEBOOK_LIKES,IMDB_SCORE,TITLE_YEAR.1
0,Avatar?ï¿½,723,178.0,10,855,1000,760505847,886204.0,4834.0,0.0,3054,237000000,2009,936.0,7.9,2009.0
1,Pirates of the Caribbean: At World's End?ï¿½,302,0.0,563,1000,40000,309404152,471220.0,48350.0,0.0,1238,300000000,2007,5000.0,7.1,0.0
2,Spectre?ï¿½,602,148.0,20,161,11000,200074175,275868.0,11700.0,1.0,994,245000000,2015,393.0,6.8,2015.0
3,The Dark Knight Rises?ï¿½,813,0.0,22000,23000,27000,448130642,1144337.0,106759.0,0.0,2701,250000000,2012,23000.0,8.5,0.0
4,John Carter?ï¿½,462,132.0,"""475""",530,640,73058679,212204.0,1873.0,1.0,738,263700000,2012,632.0,6.6,0.0

In [123]:
df['DURATION']

0     178.0
1       NaN
2     148.0
3       NaN
4     132.0
5     156.0
6       NaN
7     141.0
8     141.0
9     153.0
10    183.0
11    169.0
12    106.0
13    151.0
Name: DURATION, dtype: float64

In [124]:
df['DURATION'].mean() # calculates the mean of the duration column

150.72727272727272

In [125]:
df_with_mean = df.DURATION.fillna(df['DURATION'].mean()) # Fills the duration column with the mean value

In [126]:
df_with_mean

0     178.000000
1     150.727273
2     148.000000
3     150.727273
4     132.000000
5     156.000000
6     150.727273
7     141.000000
8     141.000000
9     153.000000
10    183.000000
11    169.000000
12    106.000000
13    151.000000
Name: DURATION, dtype: float64

Dropping NAs

In [127]:
df.head()

,MOVIE_TITLE,NUM_CRITIC_FOR_REVIEWS,DURATION,DIRECTOR_FACEBOOK_LIKES,ACTOR_3_FACEBOOK_LIKES,ACTOR_1_FACEBOOK_LIKES,GROSS,NUM_VOTED_USERS,CAST_TOTAL_FACEBOOK_LIKES,FACENUMBER_IN_POSTER,NUM_USER_FOR_REVIEWS,BUDGET,TITLE_YEAR,ACTOR_2_FACEBOOK_LIKES,IMDB_SCORE,TITLE_YEAR.1
0,Avatar?ï¿½,723,178.0,10,855,1000,760505847,886204.0,4834.0,NaN,3054,237000000,2009,936.0,7.9,2009.0
1,Pirates of the Caribbean: At World's End?ï¿½,302,NaN,563,1000,40000,309404152,471220.0,48350.0,NaN,1238,300000000,2007,5000.0,7.1,NaN
2,Spectre?ï¿½,602,148.0,20,161,11000,200074175,275868.0,11700.0,1.0,994,245000000,2015,393.0,6.8,2015.0
3,The Dark Knight Rises?ï¿½,813,NaN,22000,23000,27000,448130642,1144337.0,106759.0,NaN,2701,250000000,2012,23000.0,8.5,NaN
4,John Carter?ï¿½,462,132.0,"""475""",530,640,73058679,212204.0,1873.0,1.0,738,263700000,2012,632.0,6.6,NaN

In [128]:
df.isnull().sum().sum()

21

In [129]:
df.shape

(14, 16)

In [130]:
df_drop = df.dropna()

In [131]:
df_drop.shape

(4, 16)

In [132]:
df_drop

,MOVIE_TITLE,NUM_CRITIC_FOR_REVIEWS,DURATION,DIRECTOR_FACEBOOK_LIKES,ACTOR_3_FACEBOOK_LIKES,ACTOR_1_FACEBOOK_LIKES,GROSS,NUM_VOTED_USERS,CAST_TOTAL_FACEBOOK_LIKES,FACENUMBER_IN_POSTER,NUM_USER_FOR_REVIEWS,BUDGET,TITLE_YEAR,ACTOR_2_FACEBOOK_LIKES,IMDB_SCORE,TITLE_YEAR.1
2,Spectre?ï¿½,602,148.0,20,161,11000,200074175,275868.0,11700.0,1.0,994,245000000,2015,393.0,6.8,2015.0
8,Avengers: Age of Ultron?ï¿½,635,141.0,10,19000,26000,458991599,462669.0,92000.0,4.0,1117,250000000,2015,21000.0,7.5,2015.0
12,Quantum of Solace?ï¿½,403,106.0,395,393,451,168368427,330784.0,2023.0,1.0,1243,200000000,2008,412.0,6.7,2008.0
13,Pirates of the Caribbean: Dead Man's Chest?ï¿½,313,151.0,563,1000,40000,423032628,522040.0,48486.0,2.0,1832,225000000,2006,5000.0,7.3,2008.0

In [133]:
df_with_condition = df.dropna(how = 'any') # a condition that specifies how you want to drop a data.

In [134]:
df_with_condition = df.dropna(thresh = 2) # a condition that allows for dropping missing values incase it has more

In [135]:
?df.dropna

Signature:
df.dropna(
    axis: 'Axis' = 0,
    how: 'str' = 'any',
    thresh=None,
    subset=None,
    inplace: 'bool' = False,
)
Docstring:
Remove missing values.

See the :ref:`User Guide <missing_data>` for more on which values are
considered missing, and how to work with missing data.

Parameters
----------
axis : {0 or 'index', 1 or 'columns'}, default 0
    Determine if rows or columns which contain missing values are
    removed.

    * 0, or 'index' : Drop rows which contain missing values.
    * 1, or 'columns' : Drop columns which contain missing value.

    .. versionchanged:: 1.0.0

       Pass tuple or list to drop on multiple axes.
       Only a single axis is allowed.

how : {'any', 'all'}, default 'any'
    Determine if row or column is removed from DataFrame, when we have
    at least one NA or all NA.

    * 'any' : If any NA values are present, drop that row or column.
    * 'all' : If all values are NA, drop that row or column.

thresh : int, optional
    Require that many non-NA values.
subset : array-like, optional
    Labels along other axis to consider, e.g. if you are dropping rows
    these would be a list of columns to include.
inplace : bool, default False
    If True, do operation inplace and return None.

Returns
-------
DataFrame or None
    DataFrame with NA entries dropped from it or None if ``inplace=True``.

See Also
--------
DataFrame.isna: Indicate missing values.
DataFrame.notna : Indicate existing (non-missing) values.
DataFrame.fillna : Replace missing values.
Series.dropna : Drop missing values.
Index.dropna : Drop missing indices.

Examples
--------
>>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
...                             pd.NaT]})
>>> df
       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Drop the rows where at least one element is missing.

>>> df.dropna()
     name        toy       born
1  Batman  Batmobile 1940-04-25

Drop the columns where at least one element is missing.

>>> df.dropna(axis='columns')
       name
0    Alfred
1    Batman
2  Catwoman

Drop the rows where all elements are missing.

>>> df.dropna(how='all')
       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Keep only the rows with at least 2 non-NA values.

>>> df.dropna(thresh=2)
       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Define in which columns to look for missing values.

>>> df.dropna(subset=['name', 'toy'])
       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Keep the DataFrame with valid entries in the same variable.

>>> df.dropna(inplace=True)
>>> df
     name        toy       born
1  Batman  Batmobile 1940-04-25
File:      c:\users\user\anaconda3\lib\site-packages\pandas\core\frame.py
Type:      method

In [136]:
df_with_condition = df.dropna(thresh = 1)

In [137]:
df_with_condition.shape

(14, 16)

In [138]:
df_drop_column = df.dropna(axis = 1) # drops or deletes useless colums

In [139]:
df_drop_column.shape

(14, 9)

## Data Cleaning In Python Practical Examples 3 ##

In [140]:
# Load Packages
import pandas as pd

In [141]:
# Load Dataset
df = pd.read_csv('C:\\Users\\user\\Desktop\\Jupyter notebooks for Data Science\\dataset.csv')

df.head()

In [142]:
df.columns

Index(['id', 'Full Name', 'Date of Birth', 'email', 'gender', 'Job', 'Company',
       'Country', 'Salary', 'Phone', 'Quote', 'Income', 'Income.1'],
      dtype='object')

In [143]:
df.columns.str.lower()

Index(['id', 'full name', 'date of birth', 'email', 'gender', 'job', 'company',
       'country', 'salary', 'phone', 'quote', 'income', 'income.1'],
      dtype='object')

In [144]:
df.columns = df.columns.str.lower()

In [145]:
# Renaming
df.rename(columns = {'full name': 'full name', 'date of birth': 'date of birth'})

,id,full name,date of birth,email,gender,job,company,country,salary,phone,quote,income,income.1
0,1,Salim Pound,2/12/2018,spound0@spotify.com,Male,Editor,Gigashots,Israel,19QtDp5HkyuZZqwwqzYPSSLuA7MXFCwfKL,610-741-3882,Compatible discrete leverage,46476.638080,$46476.6380809961
1,2,Madelene Lutas,9/20/2018,mlutas1@si.edu,Female,VP Marketing,Wikivu,Mongolia,17ADLE8HiTj7m1tTbzboLDn7eiZ4TjetzZ,221-725-8860,Grass-roots real-time algorithm,54174.687950,$54174.6879482406
2,3,Dolli Swanbourne,11/18/2018,dswanbourne2@istockphoto.com,Female,Associate Professor,Dabfeed,Vietnam,16ThVxH72YAXWiEBeBZB1WYtXcfJMwUtoB,303-720-8280,Innovative system-worthy definition,5449.873348,$5449.87334818567
3,4,Graeme Croisier,9/29/2018,gcroisier3@parallels.com,Male,Mechanical Systems Engineer,Trudoo,Bosnia and Herzegovina,1JLUVwmjHvxgh53C7Afie3pWbjrYxV9Fnx,673-794-9917,Customer-focused didactic extranet,46784.630880,$46784.6308786279
4,5,Jillana Physic,4/19/2018,jphysic4@yellowbook.com,Female,Account Executive,Buzzshare,China,1DaEUNoAWL68pnvThSM5eBYgQMTv9mKyFG,709-146-6263,Progressive dynamic model,57486.495560,$57486.4955595568
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Willie Gravestone,1/17/2018,wgravestonern@typepad.com,Female,Junior Executive,Cogilith,China,1NhweMA6xVPvFfYyQfRvusazTkMvuP8kap,717-137-5667,Automated content-based superstructure,33868.404190,$33868.4041871395
996,997,Samara McRitchie,12/10/2018,smcritchiero@wikispaces.com,Female,Media Manager II,Edgewire,Philippines,1t9C9e457Z6efZCZ46Ywm84Xgw79WEBW9,583-849-4461,Proactive content-based throughput,46290.780360,$46290.7803582873
997,998,Joceline Josefowicz,10/18/2018,jjosefowiczrp@statcounter.com,Female,Design Engineer,Mynte,Puerto Rico,13pFvvCyTz5AFNhk7ugp9G6aYA89wVJFns,934-388-0702,Phased transitional monitoring,24202.032530,$24202.0325327311
998,999,Andrei Lestor,1/16/2018,alestorrq@storify.com,Female,Senior Editor,Reallinks,China,1CTz1ejJhKvKUvV7tMgQ97wCguJpRAVZan,706-201-1239,Organic dynamic strategy,54316.293830,$54316.2938322092
999,1000,Nikkie Langtry,10/30/2018,nlangtryrr@sciencedaily.com,Female,Financial Advisor,Linklinks,Armenia,1JFRCVhkbkR9TFrS2RKezc7HKoteeUHzR,612-915-7537,Managed solution-oriented implementation,56477.000000,$56477

In [146]:
df.columns

Index(['id', 'full name', 'date of birth', 'email', 'gender', 'job', 'company',
       'country', 'salary', 'phone', 'quote', 'income', 'income.1'],
      dtype='object')

In [147]:
df.rename(columns = {'full name': 'full_name', 'date of birth': 'date_of_birth'}, inplace = True)

In [148]:
df.columns

Index(['id', 'full_name', 'date_of_birth', 'email', 'gender', 'job', 'company',
       'country', 'salary', 'phone', 'quote', 'income', 'income.1'],
      dtype='object')

Splitting columns into multiple

In [149]:
# Method 1
df.full_name

0              Salim Pound
1           Madelene Lutas
2         Dolli Swanbourne
3          Graeme Croisier
4           Jillana Physic
              ...
995      Willie Gravestone
996       Samara McRitchie
997    Joceline Josefowicz
998          Andrei Lestor
999         Nikkie Langtry
Name: full_name, Length: 1000, dtype: object

In [150]:
df.full_name.str.split("")

0                  [, S, a, l, i, m,  , P, o, u, n, d, ]
1         [, M, a, d, e, l, e, n, e,  , L, u, t, a, s, ]
2      [, D, o, l, l, i,  , S, w, a, n, b, o, u, r, n...
3      [, G, r, a, e, m, e,  , C, r, o, i, s, i, e, r, ]
4         [, J, i, l, l, a, n, a,  , P, h, y, s, i, c, ]
                             ...
995    [, W, i, l, l, i, e,  , G, r, a, v, e, s, t, o...
996    [, S, a, m, a, r, a,  , M, c, R, i, t, c, h, i...
997    [, J, o, c, e, l, i, n, e,  , J, o, s, e, f, o...
998          [, A, n, d, r, e, i,  , L, e, s, t, o, r, ]
999       [, N, i, k, k, i, e,  , L, a, n, g, t, r, y, ]
Name: full_name, Length: 1000, dtype: object

In [151]:
df.full_name.str.split("")[0]

['', 'S', 'a', 'l', 'i', 'm', ' ', 'P', 'o', 'u', 'n', 'd', '']

In [152]:
df.full_name.str.split("").str.get(0)

0
1
2
3
4
      ..
995
996
997
998
999
Name: full_name, Length: 1000, dtype: object

In [153]:
df['firstname'] = df.full_name.str.split("").str.get(0)

In [154]:
df.firstname

0
1
2
3
4
      ..
995
996
997
998
999
Name: firstname, Length: 1000, dtype: object

In [155]:
df['lastname'] = df.full_name.str.split("").str.get(1)

In [156]:
df.lastname

0      S
1      M
2      D
3      G
4      J
      ..
995    W
996    S
997    J
998    A
999    N
Name: lastname, Length: 1000, dtype: object

In [157]:
# Method 2
df.full_name

0              Salim Pound
1           Madelene Lutas
2         Dolli Swanbourne
3          Graeme Croisier
4           Jillana Physic
              ...
995      Willie Gravestone
996       Samara McRitchie
997    Joceline Josefowicz
998          Andrei Lestor
999         Nikkie Langtry
Name: full_name, Length: 1000, dtype: object

In [159]:
df.full_name.str.split("", expand = True)

,0,1,2,3,4,5,6,7,8,9,...,15,16,17,18,19,20,21,22,23,24
0,,S,a,l,i,m,,P,o,u,...,None,None,None,None,None,None,None,None,None,None
1,,M,a,d,e,l,e,n,e,,...,,None,None,None,None,None,None,None,None,None
2,,D,o,l,l,i,,S,w,a,...,n,e,,None,None,None,None,None,None,None
3,,G,r,a,e,m,e,,C,r,...,r,,None,None,None,None,None,None,None,None
4,,J,i,l,l,a,n,a,,P,...,,None,None,None,None,None,None,None,None,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,,W,i,l,l,i,e,,G,r,...,o,n,e,,None,None,None,None,None,None
996,,S,a,m,a,r,a,,M,c,...,i,e,,None,None,None,None,None,None,None
997,,J,o,c,e,l,i,n,e,,...,o,w,i,c,z,,None,None,None,None
998,,A,n,d,r,e,i,,L,e,...,None,None,None,None,None,None,None,None,None,None
999,,N,i,k,k,i,e,,L,a,...,,None,None,None,None,None,None,None,None,None

In [160]:
df.full_name.str.split("", n=1, expand = True)

    0                     1
0               Salim Pound
1            Madelene Lutas
2          Dolli Swanbourne
3           Graeme Croisier
4            Jillana Physic
..  ..                  ...
995       Willie Gravestone
996        Samara McRitchie
997     Joceline Josefowicz
998           Andrei Lestor
999          Nikkie Langtry

[1000 rows x 2 columns]

In [ ]:
df.head(3)

In [ ]:
# Finding A string/Exp N Replace

In [ ]:
df['income.1']

In [ ]:
df['income.1'].dtype

In [ ]:
df['income.1'].str.replace('$', '')

In [ ]:
df['income.1'].str.replace('$', 'Euro')

In [ ]:
df.head()

In [ ]:
# Finding A string/Expression
+ str.contain
+ str.filter
+ str.match

In [ ]:
df.salary

In [ ]:
# As Boolean
df.salary.str.contains('19')

In [ ]:
# get the actual value
df[df.salary.str.contains('19')]

In [ ]:
df.salary.str.contains('19|17')

In [ ]:
df.salary.str.contains('19|17', regex = True)

In [ ]:
df.salary.str.match('19')

In [ ]:
df.quote

In [ ]:
df[df.quote.str.match('operative')]

In [ ]:
# Finding An Index
df.salary.filter(regex = '18', axis = 0)

In [ ]:
# Joining Colunms
df.head()

In [ ]:
# Method 1
df.'firstname' + df.'email'

In [ ]:
# Method 1
df.firstname + '_' + df.email

In [ ]:
# Method 2
dfall = df[['firstname', 'email']].apply ('_ '.join, axis = 1)

In [ ]:
dfall

In [ ]:
# Counting Strings in a Column
df.quote

In [ ]:
df.quote.str.count('') + 1

In [ ]:
df.quote.str.split().str.len()

In [ ]:
df.quote.str.split().map(len)

In [ ]:
df.quote.str.split().apply(len)

In [ ]:
df.quote.str.split().apply(len).value_counts()